[
  {
      "id": "1",
      "title": "Naruto Uzumaki",
      "description": "Naruto é o protagonista da série, um jovem ninja da Vila da Folha com o sonho de se tornar Hokage. Ele possui a Raposa de Nove Caudas selada dentro de si.",
      "img_card": "https://i.pinimg.com/originals/51/08/7b/51087b124bff4399de0aef1663390b1d.gif",
      "bibliografia":{
          "intro": "Naruto Uzumaki é o protagonista da história e um ninja da Vila da Folha. Ele é conhecido por sua determinação, força de vontade e por ser o portador da raposa de nove caudas, Kurama.",
          "personalidade": "Naruto é otimista, determinado e muitas vezes impulsivo. Ele deseja ser reconhecido como o Hokage e é extremamente leal aos seus amigos e à sua vila.",
          "aparencia": "Naruto tem cabelo loiro espetado e olhos azuis. Ele usa um protetor de testa e vestes laranjas, que são suas roupas características.",
          "historia": "Naruto cresceu sendo rejeitado pelos habitantes da vila devido à besta de nove caudas dentro de si, mas sempre manteve o sonho de se tornar Hokage. Ao longo da história, ele forma laços com outros ninjas e se torna um grande herói em várias guerras."
      },
      "curiosidades": [
          "Naruto adora ramen, especialmente o do Ichiraku Ramen.",
          "Seu jutsu mais famoso é o Rasengan.",
          "Ele foi o primeiro jinchuuriki a se tornar amigo de sua besta com cauda."
      ],
      "caracteristicas": {
          "idade": "16",
          "altura": "1,66m",
          "peso": "50,9kg",
          "tiposangue": "B",
          "classificacao": "Genin",
          "cla": "Uzumaki",
          "ocupacao": "Hokage",
          "familia": "Minato Namikaze (pai), Kushina Uzumaki (mãe), Boruto Uzumaki (filho), Himawari Uzumaki (filha)"
      }
  },
  {
      "id": "2",
      "title": "Sasuke Uchiha",
      "description": "Sasuke é um dos últimos sobreviventes do clã Uchiha. Seu objetivo inicial era vingar seu clã, destruído por seu irmão mais velho, Itachi Uchiha.",
      "img_card": "https://i.pinimg.com/originals/bd/22/c5/bd22c5644c600532c3370b63134a2d35.gif",
      "bibliografia":{
          "intro": "Sasuke Uchiha é um dos últimos sobreviventes do clã Uchiha e um dos ninjas mais poderosos da história. Ele inicialmente se afasta de seus amigos para buscar vingança contra seu irmão, Itachi.",
          "personalidade": "Sasuke é sério, reservado e busca poder a qualquer custo. Sua principal motivação é vingar seu clã, mas ele acaba se afastando de tudo e de todos em sua busca.",
          "aparencia": "Sasuke tem cabelos negros e olhos escuros, com o Sharingan ativo em várias ocasiões. Ele usa roupas tradicionais de um ninja da Vila da Folha.",
          "historia": "Após a tragédia que atingiu seu clã, Sasuke se dedicou à vingança contra seu irmão Itachi, levando-o a se afastar da Vila da Folha. Mais tarde, ele se envolve em várias batalhas e busca uma nova razão de viver, com seu papel sendo crucial durante a Quarta Grande Guerra Ninja."
      },
      "curiosidades": [
          "Ele é um dos únicos usuários do Mangekyo Sharingan eterno.",
          "Sasuke é proficiente em usar os elementos relâmpago e fogo.",
          "Apesar de seu exterior frio, ele valoriza profundamente seus amigos."
      ],
      "caracteristicas": {
          "idade": "16",
          "altura": "1,68m",
          "peso": "52,2kg",
          "tiposangue": "AB",
          "classificacao": "Genin",
          "cla": "Uchiha",
          "ocupacao": "Ninja Andarilho",
          "familia": "Fugaku Uchiha (pai), Mikoto Uchiha (mãe), Itachi Uchiha (irmão)"
      }
  },
  {
      "id": "3",
      "title": "Sakura Haruno",
      "description": "Sakura é uma ninja médica da Vila da Folha e membro do Time 7, junto com Naruto e Sasuke. Ela é conhecida por sua força e habilidades de cura.",
      "img_card": "https://i.pinimg.com/originals/44/6b/c1/446bc165408c72f1e11fd9752b51d70b.gif",
      "bibliografia":{
          "intro": "Sakura Haruno é uma ninja da Vila da Folha e integrante da equipe 7, junto com Naruto e Sasuke. Ela é conhecida por sua habilidade médica e por sua força física impressionante.",
          "personalidade": "Sakura é inteligente, leal e muito determinada. Ela possui uma grande força emocional e está sempre disposta a proteger seus amigos, embora sua jornada também envolva o desenvolvimento de sua autoconfiança.",
          "aparencia": "Sakura tem cabelo rosa e olhos verdes. Ela usa roupas vermelhas e um protetor de testa, característico dos ninjas da Vila da Folha.",
          "historia": "Sakura começa como uma ninja que tem dificuldades em combate, mas ao longo da história se torna uma das melhores médicas da vila. Ela é parte importante da equipe 7 e desempenha um papel crucial durante a Quarta Grande Guerra Ninja."
      },
      "curiosidades": [
          "Sakura foi a responsável por curar inúmeras vítimas na Quarta Grande Guerra Ninja.",
          "Ela tem uma força física impressionante, capaz de quebrar o solo com um único soco.",
          "É uma das poucas personagens a dominar o controle de chakra quase perfeito."
      ],
      "caracteristicas": {
          "idade": "16",
          "altura": "1,61m",
          "peso": "45kg",
          "tiposangue": "O",
          "classificacao": "Chunin",
          "cla": "Nenhum",
          "ocupacao": "Ninja Médica",
          "familia": "Kizashi Haruno (pai), Mebuki Haruno (mãe)"
      }
  },
  {
      "id": "4",
      "title": "Kakashi Hatake",
      "description": "Kakashi é o líder do Time 7 e conhecido como o Ninja Copiador devido ao seu Sharingan, que lhe permite copiar inúmeras técnicas.",
      "img_card": "https://i.pinimg.com/originals/c5/9b/30/c59b30fed6462bf6cfcd9255471a3cc6.gif",
      "bibliografia":{
          "intro": "Kakashi Hatake é um ninja de elite da Vila da Folha e líder da primeira formação da equipe 7. Ele é conhecido por seu Sharingan e por ser uma figura enigmática e altamente respeitada.",
          "personalidade": "Kakashi é calmo, descontraído e um tanto preguiçoso, mas é extremamente inteligente e habilidoso. Ele valoriza a confiança e o trabalho em equipe e tem uma abordagem estratégica em combate.",
          "aparencia": "Kakashi tem cabelo prateado e usa uma máscara que cobre a maior parte de seu rosto, deixando apenas os olhos visíveis. Ele usa o protetor de testa e vestes padrão de um ninja.",
          "historia": "Kakashi foi inicialmente treinado por Minato Namikaze, o Quarto Hokage, e teve um papel importante na formação da nova geração de ninjas. Ele se tornou líder da equipe 7 e desempenha um papel importante nas batalhas da Quarta Grande Guerra Ninja."
      },
      "curiosidades": [
          "\"Kakashi\" significa espantalho em japonês, e seu sobrenome \"Hatake\" significa campo. Juntos, podem ser interpretados como \"Espantalho do Campo\". Isso combina com o tema ninja e a natureza.",
          "Kakashi é um grande fã da série de livros \"Icha Icha\", escrita por Jiraiya. Apesar de ser sério e focado em combate, ele adora esse tipo de literatura, o que o humaniza e adiciona humor à história.",
          "Kakashi leu quase todos os livros da série 'Make-Out Paradise' de Jiraiya.",
          "Ele é um dos poucos ninjas a dominar o Mangekyo Sharingan.",
          "Sua técnica Raikiri é uma evolução do Chidori."
      ],
      "caracteristicas": {
          "idade": "29",
          "altura": "1,81m",
          "peso": "67,5kg",
          "tiposangue": "O",
          "classificacao": "Jonin",
          "cla": "Hatake",
          "ocupacao": "Instrutor Jonin",
          "familia": "Sakumo Hatake (pai)"
      }
  },
  {
      "id": "5",
      "title": "Gaara",
      "description": "Gaara é o jinchuuriki do Shukaku e inicialmente um antagonista na série. Mais tarde, ele se torna o Kazekage da Vila da Areia.",
      "img_card": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/7e37d55c-fda0-46cc-9f2e-76228177a8e4/d1iysng-9cec0838-1384-44b3-92d3-0845b66a7b55.gif?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzdlMzdkNTVjLWZkYTAtNDZjYy05ZjJlLTc2MjI4MTc3YThlNFwvZDFpeXNuZy05Y2VjMDgzOC0xMzg0LTQ0YjMtOTJkMy0wODQ1YjY2YTdiNTUuZ2lmIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.I6Temo5t0w0OvCRzQSXl3BYdNPRo_8YLyrMWgv01Bk0",
      "bibliografia":{
          "intro": "Gaara é o atual Kazekage da Vila da Areia e é conhecido por sua força e pelo controle da besta Shukaku, uma das Nove Caudas. Ele começou sua jornada como um ninja temido e solitário.",
          "personalidade": "Gaara é inicialmente frio, isolado e obcecado pelo poder, devido à sua infância difícil. No entanto, com o tempo, ele se transforma em um líder sábio e compassivo, com um grande senso de responsabilidade.",
          "aparencia": "Gaara tem cabelo vermelho e olhos verdes, com marcas escuras ao redor de seus olhos. Ele usa um traje tradicional de Kazekage, com uma bolsa grande contendo areia nas costas.",
          "historia": "Gaara nasceu como o recipiente de Shukaku, o one-tail, e foi tratado como uma arma desde criança. Sua infância solitária e dolorosa o levou a se tornar um ninja amargurado, mas após conhecer Naruto e entender a importância da amizade, Gaara se torna Kazekage e luta pela paz em sua vila."
      },
      "curiosidades": [
          "Gaara é especialista em manipulação de areia.",
          "Ele nunca dormia na infância por medo de perder o controle de Shukaku.",
          "Seu nome significa 'demônio que ama apenas a si mesmo'."
      ],
      "caracteristicas": {
          "idade": "16",
          "altura": "1,66m",
          "peso": "50,9kg",
          "tiposangue": "AB",
          "classificacao": "Kazekage",
          "cla": "Nenhum",
          "ocupacao": "Líder da Vila da Areia",
          "familia": "Rasa (pai), Karura (mãe), Kankuro (irmão), Temari (irmã)"
      }
  },
  {
      "id": "6",
      "title": "Itachi Uchiha",
      "description": "Itachi é o irmão mais velho de Sasuke. Ele eliminou todo o seu clã para proteger Konoha e é um membro da Akatsuki.",
      "img_card": "https://i.pinimg.com/originals/0c/34/1a/0c341a7395f7770bd7ab42ea277c2263.gif",
      "bibliografia":{
          "intro": "Itachi Uchiha é um dos ninjas mais poderosos da história de *Naruto*, famoso por sua habilidade com o Sharingan. Ele é responsável pela destruição de seu próprio clã, embora seus motivos sejam mais complexos do que aparentam.",
          "personalidade": "Itachi é calmo, introspectivo e sempre tem um plano. Ele age de maneira enigmática e, por trás de sua fachada fria, possui um grande senso de sacrifício e lealdade à sua vila.",
          "aparencia": "Itachi tem cabelo preto e olhos vermelhos, com o Sharingan ativo. Ele usa o manto da Akatsuki e o protetor de testa da Vila da Folha, embora tenha abandonado a vila.",
          "historia": "Itachi foi um prodígio da Vila da Folha, mas acabou matando todo o seu clã, exceto seu irmão Sasuke, em uma tentativa de proteger a vila de uma ameaça maior. Ao longo da história, revela-se que suas ações foram motivadas por um sacrifício doloroso para salvar a vila e seu irmão."
      },
      "curiosidades": [
          "Itachi dominou o Sharingan aos 8 anos.",
          "Ele é conhecido por sua habilidade com genjutsus.",
          "Seus sacrifícios foram revelados somente após sua morte."
      ],
      "caracteristicas": {
          "idade": "21",
          "altura": "1,78m",
          "peso": "58kg",
          "tiposangue": "AB",
          "classificacao": "Anbu (antigo)",
          "cla": "Uchiha",
          "ocupacao": "Membro da Akatsuki",
          "familia": "Fugaku Uchiha (pai), Mikoto Uchiha (mãe), Sasuke Uchiha (irmão)"
      }
  },
  {
      "id": "7",
      "title": "Hinata Hyuga",
      "description": "Hinata é uma ninja da Vila da Folha que faz parte do clã Hyuga. Ela é tímida, mas extremamente dedicada e tem uma grande admiração por Naruto.",
      "img_card": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/7dfa6b8b-2310-4b8d-8e23-51fdcd36a4b8/d8qo5ob-08259e68-0083-4142-bb84-fff83e8d113e.gif?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzdkZmE2YjhiLTIzMTAtNGI4ZC04ZTIzLTUxZmRjZDM2YTRiOFwvZDhxbzVvYi0wODI1OWU2OC0wMDgzLTQxNDItYmI4NC1mZmY4M2U4ZDExM2UuZ2lmIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.Ki8Upmjnt3MgZlNyWSlOm_ujMN137ZOa2TEav2kaQUU",
      "bibliografia":{
          "intro": "Hinata Hyuga é uma ninja da Vila da Folha conhecida por sua gentileza e habilidades no estilo de luta do clã Hyuga. Ela é uma das personagens mais dedicadas e corajosas da série, superando sua timidez para se tornar uma ninja excepcional.",
          "personalidade": "Hinata é gentil, tímida e compassiva, mas também corajosa e determinada. Ela é conhecida por sua lealdade e amor por Naruto.",
          "aparencia": "Hinata tem cabelos azul-escuros e olhos brancos perolados, característicos do Byakugan. Ela usa roupas tradicionais do clã Hyuga.",
          "historia": "Hinata cresceu em uma família rígida e competitiva, mas sempre foi gentil e compassiva. Ela admirava Naruto desde a infância e o apoiou em sua jornada para se tornar Hokage."
      },
      "curiosidades": [
          "Ela é usuária do Byakugan.",
          "Hinata é mestre no estilo de luta Punho Gentil.",
          "Ela foi crucial na luta contra Pain, ao tentar proteger Naruto."
      ],
      "caracteristicas": {
          "idade": "16",
          "altura": "1,60m",
          "peso": "45kg",
          "tiposangue": "A",
          "classificacao": "Chunin",
          "cla": "Hyuga",
          "ocupacao": "Ninja da Folha",
          "familia": "Hiashi Hyuga (pai), Neji Hyuga (primo)"
      }
  },
  {
      "id": "8",
      "title": "Rock Lee",
      "description": "Rock Lee é um ninja dedicado que não consegue usar ninjutsu ou genjutsu, mas compensa isso com seu taijutsu excepcional.",
      "img_card": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/898e616d-95aa-4b8c-b6ee-0597ecee0b31/d1i9i2g-15ac752d-b36a-447a-a702-9159551fb7b9.gif?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzg5OGU2MTZkLTk1YWEtNGI4Yy1iNmVlLTA1OTdlY2VlMGIzMVwvZDFpOWkyZy0xNWFjNzUyZC1iMzZhLTQ0N2EtYTcwMi05MTU5NTUxZmI3YjkuZ2lmIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.FSwqw3SGhZJYCPQjv9FtFlqlfMSJSxIm3UecChom99o",
      "bibliografia":{
          "intro": "Rock Lee é um ninja da Vila da Folha conhecido por sua dedicação e habilidades em taijutsu. Incapaz de usar ninjutsu ou genjutsu, ele treinou incansavelmente para se tornar um mestre em combate corpo a corpo.",
          "personalidade": "Lee é extremamente dedicado e determinado, nunca desistindo de um desafio. Ele é conhecido por sua paixão por treinar e se esforçar para superar seus limites.",
          "aparencia": "Rock Lee tem cabelos castanhos curtos e sobrancelhas grossas. Ele usa roupas verdes e um protetor de testa da Vila da Folha.",
          "historia": "Lee treinou sob Might Guy, seu mentor e um dos ninjas mais fortes da Vila da Folha. Ele é conhecido por suas técnicas de taijutsu, como o Oito Portões Internos. Lee participou de várias batalhas cruciais, incluindo a Quarta Grande Guerra"
      },
      "curiosidades": [
          "Rock Lee nunca desistiu de um treino, não importa o quão difícil.",
          "Ele é conhecido por usar os Oito Portões Internos.",
          "Rock Lee admira profundamente Might Guy, seu mentor."
      ],
      "caracteristicas": {
          "idade": "17",
          "altura": "1,72m",
          "peso": "54kg",
          "tiposangue": "A",
          "classificacao": "Chunin",
          "cla": "Nenhum",
          "ocupacao": "Ninja da Folha",
          "familia": "Desconhecida"
      }
  },{
    "id": "8",
    "title": "Rock Lee",
    "description": "Rock Lee é um ninja dedicado que não consegue usar ninjutsu ou genjutsu, mas compensa isso com seu taijutsu excepcional.",
    "img_card": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/898e616d-95aa-4b8c-b6ee-0597ecee0b31/d1i9i2g-15ac752d-b36a-447a-a702-9159551fb7b9.gif?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzg5OGU2MTZkLTk1YWEtNGI4Yy1iNmVlLTA1OTdlY2VlMGIzMVwvZDFpOWkyZy0xNWFjNzUyZC1iMzZhLTQ0N2EtYTcwMi05MTU5NTUxZmI3YjkuZ2lmIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.FSwqw3SGhZJYCPQjv9FtFlqlfMSJSxIm3UecChom99o",
    "bibliografia":{
        "intro": "Rock Lee é um ninja da Vila da Folha conhecido por sua dedicação e habilidades em taijutsu. Incapaz de usar ninjutsu ou genjutsu, ele treinou incansavelmente para se tornar um mestre em combate corpo a corpo.",
        "personalidade": "Lee é extremamente dedicado e determinado, nunca desistindo de um desafio. Ele é conhecido por sua paixão por treinar e se esforçar para superar seus limites.",
        "aparencia": "Rock Lee tem cabelos castanhos curtos e sobrancelhas grossas. Ele usa roupas verdes e um protetor de testa da Vila da Folha.",
        "historia": "Lee treinou sob Might Guy, seu mentor e um dos ninjas mais fortes da Vila da Folha. Ele é conhecido por suas técnicas de taijutsu, como o Oito Portões Internos. Lee participou de várias batalhas cruciais, incluindo a Quarta Grande Guerra"
    },
    "curiosidades": [
        "Rock Lee nunca desistiu de um treino, não importa o quão difícil.",
        "Ele é conhecido por usar os Oito Portões Internos.",
        "Rock Lee admira profundamente Might Guy, seu mentor."
    ],
    "caracteristicas": {
        "idade": "17",
        "altura": "1,72m",
        "peso": "54kg",
        "tiposangue": "A",
        "classificacao": "Chunin",
        "cla": "Nenhum",
        "ocupacao": "Ninja da Folha",
        "familia": "Desconhecida"
    }
}

]
